lab-5/lab05_files/lab05_files/relatorio.org
#+TITLE: Laboratório 5 @@latex:\\@@ Relatório
#+AUTHOR: Nícolas Rosenthal Dal Corso
#+DATE: Ciência de Dados (INF 01090/2026) @@latex:\\\\@@ May, 2026
#+LANGUAGE: pt-br

# Exportação
#+OPTIONS: toc:3 num:t H:4 ':t ^:nil todo:nil tags:nil

# Classe e pacotes LaTeX
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [12pt,a4paper]

#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[brazil]{babel}

# Margens
#+LATEX_HEADER: \usepackage[top=2.5cm,bottom=2.5cm,left=3cm,right=2.5cm]{geometry}

# Tipografia
#+LATEX_HEADER: \usepackage{lmodern}
#+LATEX_HEADER: \usepackage{microtype}

# Código-fonte com destaque de sintaxe
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \setminted{fontsize=\small, linenos=false, breaklines=true, bgcolor=gray!6}

# Hiperlinks (deve vir por último entre os pacotes de formatação)
#+LATEX_HEADER: \usepackage[colorlinks=true, linkcolor=black, urlcolor=blue, citecolor=black]{hyperref}

# Cabeçalho e rodapé
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \fancyhf{}
#+LATEX_HEADER: \fancyhead[L]{\small INF01090 — Ciência de Dados}
#+LATEX_HEADER: \fancyhead[R]{\small Laboratório 5}
#+LATEX_HEADER: \fancyfoot[C]{\thepage}
#+LATEX_HEADER: \renewcommand{\headrulewidth}{0.4pt}

# Espaçamento entre linhas
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \setstretch{1.15}

# Blocos de código não-minted (BEGIN_EXAMPLE, BEGIN_SRC sem minted)
#+LATEX_HEADER: \usepackage{fancyvrb}

#  Mapeamento de ambientes src → minted
#+LATEX_HEADER: \usepackage{etoolbox}

#  Configuração do exportador
# Usar minted no lugar do verbatim padrão para blocos #+BEGIN_SRC
#+LATEX_HEADER_EXTRA: \AtBeginDocument{\setlength{\parskip}{4pt}}

* Visão Geral

Este relatório descreve a implementação do /pipeline/ de predição de preços de
imóveis desenvolvido para a competição /House Prices - Advanced Regression
Techniques/ (Kaggle), adaptada para o conjunto de dados de avaliação da
disciplina =INF01090/2026=.

O modelo final é um *stack ensemble* de dois níveis com meta-blending via
Optuna, cujo OOF RMSE (em escala log) obtido foi de *0.112577*.

Todas as submissões ocorreram sob o nome =n-rosenthal=.

* Dados e Pré-processamento

** Conjunto de Dados

| Atributo         | Valor                            |
|------------------+----------------------------------|
| Linhas (treino)  | 1 016 (após remoção de outliers) |
| Linhas (teste)   | 438                              |
| Features brutas  | 80 variáveis                     |
| Features finais  | 125 (após engenharia)            |
| Target           | ~SalePrice~ (numérica, contínua) |

** Remoção de Outliers

Cinco regras de filtragem foram aplicadas sobre o conjunto de treino:

#+BEGIN_SRC python
train_df = train_df[train_df["GrLivArea"] < 4500]
train_df = train_df[~((train_df["GrLivArea"] > 4000) & (train_df["SalePrice"] < 200_000))]
train_df = train_df[train_df["LotArea"] < 100_000]
train_df = train_df[train_df["TotalBsmtSF"] < 6_000]
train_df = train_df[~((train_df["OverallQual"] <= 4) & (train_df["SalePrice"] > 300_000))]
#+END_SRC

Essas regras removem imóveis com /living area/ muito grande, lotes
exageradamente grandes e combinações de baixa qualidade com preço alto, que
distorceriam o aprendizado.

** Transformação da Target

O preço de venda (~SalePrice~) foi transformado via ~log1p~ antes do
treinamento e revertido via ~expm1~ nas predições finais. Isso reduz a
assimetria da distribuição e estabiliza o treinamento dos modelos de boosting.

** Correção de Tipos

~MSSubClass~, ~MoSold~ e ~YrSold~ são variáveis *nominais*, não números
contínuos. A conversão para =string= é feita *antes* da separação entre
~cat_cols~ e ~num_cols~, garantindo que sejam tratadas como categorias pelo
=TargetEncoder= e não como grandezas ordenadas.

#+BEGIN_SRC python
def fix_dtypes(df):
    for col in ["MSSubClass", "MoSold", "YrSold"]:
        if col in df.columns:
            df[col] = df[col].astype(str)
    return df
#+END_SRC

** Imputação de Valores Ausentes

Duas estratégias foram adotadas:

- *Colunas categóricas sem valor* (~Alley~, ~MasVnrType~, ~MiscFeature~):
  preenchidas com a string ~"None"~, que é mapeada para 0 nos encodings
  ordinais.

- *Colunas numéricas* (~MasVnrArea~, ~BsmtFinSF1/2~, ~GarageArea~, etc.):
  preenchidas com ~0~, representando ausência do atributo.

- *~GarageYrBlt~*: imputado com ~YearBuilt~ do próprio imóvel (não com ~0~,
  que geraria um ano inválido e introduziria viés semântico).

#+BEGIN_SRC python
mask = df["GarageYrBlt"].isna()
df.loc[mask, "GarageYrBlt"] = df.loc[mask, "YearBuilt"]
#+END_SRC

** Encoding Ordinal

Variáveis de qualidade com escala natural (=Ex > Gd > TA > Fa > Po=) foram
codificadas numericamente por mapeamento direto, evitando que o modelo trate
categorias ordenadas como nominais:

| Coluna          | Escala                              |
|-----------------+-------------------------------------|
| ~ExterQual~     | Ex=5, Gd=4, TA=3, Fa=2, Po=1, NA=0 |
| ~BsmtQual~      | (idem acima)                        |
| ~KitchenQual~   | (idem acima)                        |
| ~BsmtFinType1~  | GLQ=6, ALQ=5, … Unf=1, NA=0        |
| ~BsmtExposure~  | Gd=4, Av=3, Mn=2, No=1, NA=0       |
| ~Functional~    | Typ=8, Min1=7, … Sal=1             |
| ~GarageFinish~  | Fin=3, RFn=2, Unf=1, NA=0          |

* Engenharia de Features

Foram criadas 45 features adicionais, organizadas em sete grupos:

** Área Total e Contagens

#+BEGIN_SRC python
df["TotalSF"]        = df["TotalBsmtSF"] + df["1stFlrSF"] + df["2ndFlrSF"]
df["TotalBathrooms"] = df["FullBath"] + 0.5*df["HalfBath"] + \
                       df["BsmtFullBath"] + 0.5*df["BsmtHalfBath"]
df["TotalPorchSF"]   = df["OpenPorchSF"] + df["EnclosedPorch"] + \
                       df["3SsnPorch"]   + df["ScreenPorch"]
df["GarageScore"]    = df["GarageCars"] * df["GarageArea"]
#+END_SRC

** Features Temporais

#+BEGIN_SRC python
df["HouseAge"]       = df["YrSold"].astype(int) - df["YearBuilt"]
df["RemodAge"]       = df["YrSold"].astype(int) - df["YearRemodAdd"]
df["TimeSinceRemod"] = df["YrSold"].astype(int) - df["YearRemodAdd"]
df["IsNew"]          = (df["YrSold"].astype(int) == df["YearBuilt"]).astype(int)
df["IsRemodeled"]    = (df["YearRemodAdd"] != df["YearBuilt"]).astype(int)
#+END_SRC

** Flags Binárias

Nove flags indicam presença/ausência de atributos importantes:
~HasPool~, ~Has2ndFloor~, ~HasGarage~, ~HasBsmt~, ~HasFireplace~,
~IsRemodeled~, ~IsNew~, ~HasMasVnr~, ~HasPorch~.

** Interações Multiplicativas

#+BEGIN_SRC python
df["OverallQual_TotalSF"]   = df["OverallQual"] * df["TotalSF"]
df["OverallQual_GrLivArea"] = df["OverallQual"] * df["GrLivArea"]
df["OverallQual_sq"]        = df["OverallQual"] ** 2
df["QualCondScore"]         = df["OverallQual"] * df["OverallCond"]
df["QualAge"]               = df["OverallQual"] / df["HouseAge"].clip(1)
df["NewAndQual"]            = df["IsNew"] * df["OverallQual"]
#+END_SRC

** Log-Transforms de Features Assimétricas

#+BEGIN_SRC python
df["LotAreaLog"]    = np.log1p(df["LotArea"])
df["GrLivAreaLog"]  = np.log1p(df["GrLivArea"])
df["TotalSFLog"]    = np.log1p(df["TotalSF"])
df["GarageAreaLog"] = np.log1p(df["GarageArea"])
#+END_SRC

** Razões (/Ratios/)

#+BEGIN_SRC python
df["LivAreaRatio"]   = df["GrLivArea"]   / df["TotalSF"].clip(1)
df["BsmtRatio"]      = df["TotalBsmtSF"] / df["TotalSF"].clip(1)
df["GarageRatio"]    = df["GarageArea"]  / df["GrLivArea"].clip(1)
df["LotFrontRatio"]  = df["LotFrontage"].fillna(0) / df["LotArea"].clip(1)
df["BsmtFinRatio"]   = df["BsmtFinSF1"]  / df["TotalBsmtSF"].clip(1)
df["LotAreaPerRoom"] = df["LotArea"]     / df["TotRmsAbvGrd"].clip(1)
df["SFPerRoom"]      = df["GrLivArea"]   / df["TotRmsAbvGrd"].clip(1)
#+END_SRC

