lab-5/lab05_files/lab05_files/relatorio.tex
% Created 2026-05-07 qui 08:30
% Intended LaTeX compiler: xelatex
\documentclass[12pt,a4paper]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage[brazil, brazilian]{babel}
\usepackage[top=2.5cm,bottom=2.5cm,left=3cm,right=2.5cm]{geometry}
\usepackage{lmodern}
\usepackage{microtype}
\usepackage{minted}
\setminted{fontsize=\small, linenos=false, breaklines=true, bgcolor=gray!6}
\usepackage[colorlinks=true, linkcolor=black, urlcolor=blue, citecolor=black]{hyperref}
\usepackage{fancyhdr}
\pagestyle{fancy}
\fancyhf{}
\fancyhead[L]{\small INF01090 — Ciência de Dados}
\fancyhead[R]{\small Laboratório 5}
\fancyfoot[C]{\thepage}
\renewcommand{\headrulewidth}{0.4pt}
\usepackage{setspace}
\setstretch{1.15}
\usepackage{fancyvrb}
\usepackage{etoolbox}
\AtBeginDocument{\setlength{\parskip}{4pt}}
\author{Nícolas Rosenthal Dal Corso}
\date{Ciência de Dados (INF 01090/2026) \\\\ May, 2026}
\title{Laboratório 5 \\ Relatório}
\hypersetup{
 pdfauthor={Nícolas Rosenthal Dal Corso},
 pdftitle={Laboratório 5 \\ Relatório},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={Portuges}}
\begin{document}

\maketitle
\setcounter{tocdepth}{3}
\tableofcontents

\section{Visão Geral}
\label{sec:org740da2d}

Este relatório descreve a implementação do \emph{pipeline} de predição de preços de
imóveis desenvolvido para a competição \emph{House Prices - Advanced Regression
Techniques} (Kaggle), adaptada para o conjunto de dados de avaliação da
disciplina \texttt{INF01090/2026}.

O modelo final é um \textbf{stack ensemble} de dois níveis com meta-blending via
Optuna, cujo OOF RMSE (em escala log) obtido foi de \textbf{0.112577}.

Todas as submissões ocorreram sob o nome \texttt{n-rosenthal}.
\section{Dados e Pré-processamento}
\label{sec:orgba46b6b}

\subsection{Conjunto de Dados}
\label{sec:org8b6382b}

\begin{center}
\begin{tabular}{ll}
Atributo & Valor\\
\hline
Linhas (treino) & 1 016 (após remoção de outliers)\\
Linhas (teste) & 438\\
Features brutas & 80 variáveis\\
Features finais & 125 (após engenharia)\\
Target & \texttt{SalePrice} (numérica, contínua)\\
\end{tabular}
\end{center}
\subsection{Remoção de Outliers}
\label{sec:orgcb8dd11}

Cinco regras de filtragem foram aplicadas sobre o conjunto de treino:

\begin{verbatim}
train_df = train_df[train_df["GrLivArea"] < 4500]
train_df = train_df[~((train_df["GrLivArea"] > 4000) & (train_df["SalePrice"] < 200_000))]
train_df = train_df[train_df["LotArea"] < 100_000]
train_df = train_df[train_df["TotalBsmtSF"] < 6_000]
train_df = train_df[~((train_df["OverallQual"] <= 4) & (train_df["SalePrice"] > 300_000))]
\end{verbatim}

Essas regras removem imóveis com \emph{living area} muito grande, lotes
exageradamente grandes e combinações de baixa qualidade com preço alto, que
distorceriam o aprendizado.
\subsection{Transformação da Target}
\label{sec:orgdc91d38}

O preço de venda (\texttt{SalePrice}) foi transformado via \texttt{log1p} antes do
treinamento e revertido via \texttt{expm1} nas predições finais. Isso reduz a
assimetria da distribuição e estabiliza o treinamento dos modelos de boosting.
\subsection{Correção de Tipos}
\label{sec:org1667ff4}

\texttt{MSSubClass}, \texttt{MoSold} e \texttt{YrSold} são variáveis \textbf{nominais}, não números
contínuos. A conversão para \texttt{string} é feita \textbf{antes} da separação entre
\texttt{cat\_cols} e \texttt{num\_cols}, garantindo que sejam tratadas como categorias pelo
\texttt{TargetEncoder} e não como grandezas ordenadas.

\begin{verbatim}
def fix_dtypes(df):
    for col in ["MSSubClass", "MoSold", "YrSold"]:
        if col in df.columns:
            df[col] = df[col].astype(str)
    return df
\end{verbatim}
\subsection{Imputação de Valores Ausentes}
\label{sec:org40d6b3c}

Duas estratégias foram adotadas:

\begin{itemize}
\item \textbf{Colunas categóricas sem valor} (\texttt{Alley}, \texttt{MasVnrType}, \texttt{MiscFeature}):
preenchidas com a string \texttt{"None"}, que é mapeada para 0 nos encodings
ordinais.

\item \textbf{Colunas numéricas} (\texttt{MasVnrArea}, \texttt{BsmtFinSF1/2}, \texttt{GarageArea}, etc.):
preenchidas com \texttt{0}, representando ausência do atributo.

\item \textbf{\texttt{GarageYrBlt}}: imputado com \texttt{YearBuilt} do próprio imóvel (não com \texttt{0},
que geraria um ano inválido e introduziria viés semântico).
\end{itemize}

\begin{verbatim}
mask = df["GarageYrBlt"].isna()
df.loc[mask, "GarageYrBlt"] = df.loc[mask, "YearBuilt"]
\end{verbatim}
\subsection{Encoding Ordinal}
\label{sec:org6cd0c2c}

Variáveis de qualidade com escala natural (\texttt{Ex > Gd > TA > Fa > Po}) foram
codificadas numericamente por mapeamento direto, evitando que o modelo trate
categorias ordenadas como nominais:

\begin{center}
\begin{tabular}{ll}
Coluna & Escala\\
\hline
\texttt{ExterQual} & Ex=5, Gd=4, TA=3, Fa=2, Po=1, NA=0\\
\texttt{BsmtQual} & (idem acima)\\
\texttt{KitchenQual} & (idem acima)\\
\texttt{BsmtFinType1} & GLQ=6, ALQ=5, … Unf=1, NA=0\\
\texttt{BsmtExposure} & Gd=4, Av=3, Mn=2, No=1, NA=0\\
\texttt{Functional} & Typ=8, Min1=7, … Sal=1\\
\texttt{GarageFinish} & Fin=3, RFn=2, Unf=1, NA=0\\
\end{tabular}
\end{center}
\section{Engenharia de Features}
\label{sec:org4f9480b}

Foram criadas 45 features adicionais, organizadas em sete grupos:
\subsection{Área Total e Contagens}
\label{sec:org101d0ee}

\begin{verbatim}
df["TotalSF"]        = df["TotalBsmtSF"] + df["1stFlrSF"] + df["2ndFlrSF"]
df["TotalBathrooms"] = df["FullBath"] + 0.5*df["HalfBath"] + \
                       df["BsmtFullBath"] + 0.5*df["BsmtHalfBath"]
df["TotalPorchSF"]   = df["OpenPorchSF"] + df["EnclosedPorch"] + \
                       df["3SsnPorch"]   + df["ScreenPorch"]
df["GarageScore"]    = df["GarageCars"] * df["GarageArea"]
\end{verbatim}
\subsection{Features Temporais}
\label{sec:org577b28c}

\begin{verbatim}
df["HouseAge"]       = df["YrSold"].astype(int) - df["YearBuilt"]
df["RemodAge"]       = df["YrSold"].astype(int) - df["YearRemodAdd"]
df["TimeSinceRemod"] = df["YrSold"].astype(int) - df["YearRemodAdd"]
df["IsNew"]          = (df["YrSold"].astype(int) == df["YearBuilt"]).astype(int)
df["IsRemodeled"]    = (df["YearRemodAdd"] != df["YearBuilt"]).astype(int)
\end{verbatim}
\subsection{Flags Binárias}
\label{sec:orgf539038}

Nove flags indicam presença/ausência de atributos importantes:
\texttt{HasPool}, \texttt{Has2ndFloor}, \texttt{HasGarage}, \texttt{HasBsmt}, \texttt{HasFireplace},
\texttt{IsRemodeled}, \texttt{IsNew}, \texttt{HasMasVnr}, \texttt{HasPorch}.
\subsection{Interações Multiplicativas}
\label{sec:orgad435f1}

\begin{verbatim}
df["OverallQual_TotalSF"]   = df["OverallQual"] * df["TotalSF"]
df["OverallQual_GrLivArea"] = df["OverallQual"] * df["GrLivArea"]
df["OverallQual_sq"]        = df["OverallQual"] ** 2
df["QualCondScore"]         = df["OverallQual"] * df["OverallCond"]
df["QualAge"]               = df["OverallQual"] / df["HouseAge"].clip(1)
df["NewAndQual"]            = df["IsNew"] * df["OverallQual"]
\end{verbatim}
\subsection{Log-Transforms de Features Assimétricas}
\label{sec:org16fb799}

\begin{verbatim}
df["LotAreaLog"]    = np.log1p(df["LotArea"])
df["GrLivAreaLog"]  = np.log1p(df["GrLivArea"])
df["TotalSFLog"]    = np.log1p(df["TotalSF"])
df["GarageAreaLog"] = np.log1p(df["GarageArea"])
\end{verbatim}
\subsection{Razões (\emph{Ratios})}
\label{sec:org69fdc3c}

\begin{verbatim}
df["LivAreaRatio"]   = df["GrLivArea"]   / df["TotalSF"].clip(1)
df["BsmtRatio"]      = df["TotalBsmtSF"] / df["TotalSF"].clip(1)
df["GarageRatio"]    = df["GarageArea"]  / df["GrLivArea"].clip(1)
df["LotFrontRatio"]  = df["LotFrontage"].fillna(0) / df["LotArea"].clip(1)
df["BsmtFinRatio"]   = df["BsmtFinSF1"]  / df["TotalBsmtSF"].clip(1)
df["LotAreaPerRoom"] = df["LotArea"]     / df["TotRmsAbvGrd"].clip(1)
df["SFPerRoom"]      = df["GrLivArea"]   / df["TotRmsAbvGrd"].clip(1)
\end{verbatim}
