lab-5/lab05_files/lab05_files/relatorio.org
** Scores Compostos

#+BEGIN_SRC python
df["ExterScore"]      = df["ExterQual"]    * df["ExterCond"]
df["KitchenScore"]    = df["KitchenQual"]  * df["GrLivArea"]
df["FireScore"]       = df["FireplaceQu"]  * df["Fireplaces"]
df["BsmtScore"]       = df["BsmtExposure"] * df["BsmtQual"]
df["GarageFullScore"] = df["GarageQual"]   * df["GarageCars"]
#+END_SRC

** Sazonalidade de Venda

#+BEGIN_SRC python
mo = df["MoSold"].astype(int)
df["SaleSeasonQ1"] = mo.isin([1, 2, 3]).astype(int)
# Q2, Q3, Q4 — idem
#+END_SRC

* Arquitetura do Modelo

O /pipeline/ adota uma arquitetura de *stack ensemble* em dois níveis.

** Nível 1 — Base Learners

Oito modelos de gradient boosting formam o primeiro nível:

| ID          | Algoritmo               | Profundidade | Observações                      |
|-------------+-------------------------+--------------+----------------------------------|
| ~cat_a~     | CatBoost                | 5            | Config principal; usa Optuna     |
| ~cat_b~     | CatBoost                | 6            | Mais árvores, LR menor           |
| ~cat_c~     | CatBoost                | 4            | Máxima regularização             |
| ~cat_d~     | CatBoost                | 7            | Lado mais profundo               |
| ~cat_e~     | CatBoost (Lossguide)    | 6            | Política de crescimento diferente|
| ~lgb_best~  | LightGBM                | 5            | ~num_leaves=20~; usa Optuna      |
| ~xgb_best~  | XGBoost                 | 4            | ~gamma=0.1~, conservador         |
| ~hgb~       | HistGradBoost (sklearn) | —            | Implementação ortogonal          |

Os modelos =CatBoost= dominaram o ranking OOF (0.114–0.117 RMSE), enquanto
LGB, XGB e HGB ficaram na faixa 0.124–0.126, contribuindo com diversidade ao
ensemble.

** Busca de Hiperparâmetros com Optuna

Os hiperparâmetros de ~cat_a~ e ~lgb_best~ são encontrados por busca
bayesiana com =Optuna= (~n_trials=50~), usando OOF RMSE em validação cruzada
de 5 folds como métrica. O espaço de busca cobre ~iterations~,
~learning_rate~, ~depth~, ~l2_leaf_reg~, ~bagging_temperature~,
~border_count~ e ~random_strength~ (CatBoost), e os parâmetros análogos do
LGB. Os parâmetros dos demais modelos (~cat_b~ a ~cat_e~, ~xgb_best~, ~hgb~)
são fixos e cobrem regiões complementares do espaço de hipóteses, garantindo
diversidade.

** Validação Cruzada (10-fold, 3 repetições)

O treinamento dos base learners utiliza ~RepeatedKFold~ com 10 splits e
*3 repetições* (~N_REPEATS=3~, totalizando 30 folds), o que reduz a
variância da estimativa OOF em ~√3 ≈ 1,73×~.

Para cada fold:

1. ~SimpleImputer(median)~ + ~RobustScaler~ aplicados *apenas nos dados de treino*.
2. ~TargetEncoder(smoothing=10)~ ajustado *apenas nos dados de treino*.
3. ~PCA(n_components=10)~ sobre o bloco categórico /encoded/.
4. Concatenação: ~[numérico_escalado | cat_encoded | PCA_cat]~.
5. Treinamento com early stopping (300 rounds para =CatBoost=, 200 para =LGB/XGB=).

Este procedimento garante *zero data leakage* entre folds.

** Nível 2 — Meta-Learners

Quatro estratégias de blending são treinadas sobre as predições OOF,
enriquecidas com *features de 2ª ordem* (média, desvio-padrão, máximo, mínimo
e amplitude entre os 8 modelos):

| Meta-Learner     | OOF RMSE | Notas                                           |
|------------------+----------+-------------------------------------------------|
| ~RidgeCV~        | 0.112582 | Treinado sobre features de 2ª ordem             |
| ~ElasticNetCV~   | 0.112599 | $\alpha$=0.00007, $l_1$=0.90                    |
| ~LassoCV (+)~    | 0.113698 | ~positive=True~; pesos: cat_c=0.35, cat_e=0.68 |
| Optuna (direto)  | 0.114212 | Busca /simplex/ sobre OOF base                  |

** Meta-Blending Final (Optuna)

Um segundo nível de Optuna combina os quatro meta-learners:

#+BEGIN_EXAMPLE
★ Pesos finais:
  ridge        : 0.6167
  elasticnet   : 0.3831
  lasso_pos    : 0.0001
  direct_opt   : 0.0001

★ OOF RMSE FINAL: 0.112577
#+END_EXAMPLE

** Pseudo-Labelling (2ª Passagem)

Após o blending final, amostras de teste com baixa variância entre as
predições dos 8 modelos (percentil 30 do desvio-padrão) são adicionadas ao
conjunto de treino com suas labels previstas. O /pipeline/ completo é
re-treinado sobre esse conjunto aumentado, e as predições finais são extraídas
da 2ª passagem.

#+BEGIN_SRC python
std_test  = test_matrix.std(axis=1)
confident = std_test < np.percentile(std_test, 30)
X_aug = pd.concat([X, X_test[confident]], ignore_index=True)
y_aug = pd.concat([y, pd.Series(final_log[confident])], ignore_index=True)
# → re-treino completo do CV loop sobre X_aug, y_aug
#+END_SRC

* Pré-processamento =Inside-Fold=

#+BEGIN_SRC
Para cada fold k:
  ┌─────────────────────────────────────────────────────────────────┐
  │ X_train_k, X_val_k = split(X, fold=k)                           │
  │                                                                 │
  │ imputer.fit(X_train_k[num])   → X_train_num, X_val_num          │
  │ scaler.fit(X_train_k[num])    → (RobustScaler)                  │
  │                                                                 │
  │ TargetEncoder.fit(X_train_k, y_train_k)                         │
  │   → X_train_te, X_val_te, X_test_te                             │
  │                                                                 │
  │ PCA(10).fit(X_train_te)       → X_train_pca, X_val_pca          │
  │                                                                 │
  │ X_full = hstack[num | te | pca]                                 │
  │                                                                 │
  │ Para cada base model m:                                         │
  │   model.fit(X_train_full, y_train, eval=(X_val_full, y_val))    │
  │   oof[val_idx, m] += model.predict(X_val_full)                  │
  │   test_preds[m]   += model.predict(X_test_full) / n_folds       │
  └─────────────────────────────────────────────────────────────────┘
#+END_SRC

* Resultados

** RMSE por Base Learner (OOF, escala logarítmica)

| Modelo     | OOF RMSE |
|------------+----------|
| ~cat_e~    | 0.114478 |
| ~cat_c~    | 0.115069 |
| ~cat_a~    | 0.115290 |
| ~cat_b~    | 0.116325 |
| ~cat_d~    | 0.117181 |
| ~hgb~      | 0.124021 |
| ~lgb_best~ | 0.124906 |
| ~xgb_best~ | 0.125658 |

** Resultado Final

| Métrica              | Valor                           |
|----------------------+---------------------------------|
| OOF RMSE (log)       | *0.112577*                      |
| Escala da predição   | Preço em USD                    |
| Range de predições   | [46 419 , 569 716]              |
| Arquivo de submissão | ~n-rosenthal--submission-6.csv~ |

