lab-5/lab05_files/lab05_files/relatorio.tex
\subsection{Scores Compostos}
\label{sec:orgafdcb3b}

\begin{verbatim}
df["ExterScore"]      = df["ExterQual"]    * df["ExterCond"]
df["KitchenScore"]    = df["KitchenQual"]  * df["GrLivArea"]
df["FireScore"]       = df["FireplaceQu"]  * df["Fireplaces"]
df["BsmtScore"]       = df["BsmtExposure"] * df["BsmtQual"]
df["GarageFullScore"] = df["GarageQual"]   * df["GarageCars"]
\end{verbatim}
\subsection{Sazonalidade de Venda}
\label{sec:orgca01b0e}

\begin{verbatim}
mo = df["MoSold"].astype(int)
df["SaleSeasonQ1"] = mo.isin([1, 2, 3]).astype(int)
# Q2, Q3, Q4 — idem
\end{verbatim}
\section{Arquitetura do Modelo}
\label{sec:orgb6dca74}

O \emph{pipeline} adota uma arquitetura de \textbf{stack ensemble} em dois níveis.
\subsection{Nível 1 — Base Learners}
\label{sec:org58ef214}

Oito modelos de gradient boosting formam o primeiro nível:

\begin{center}
\begin{tabular}{llrl}
ID & Algoritmo & Profundidade & Observações\\
\hline
\texttt{cat\_a} & CatBoost & 5 & Config principal; usa Optuna\\
\texttt{cat\_b} & CatBoost & 6 & Mais árvores, LR menor\\
\texttt{cat\_c} & CatBoost & 4 & Máxima regularização\\
\texttt{cat\_d} & CatBoost & 7 & Lado mais profundo\\
\texttt{cat\_e} & CatBoost (Lossguide) & 6 & Política de crescimento diferente\\
\texttt{lgb\_best} & LightGBM & 5 & \texttt{num\_leaves=20}; usa Optuna\\
\texttt{xgb\_best} & XGBoost & 4 & \texttt{gamma=0.1}, conservador\\
\texttt{hgb} & HistGradBoost (sklearn) & — & Implementação ortogonal\\
\end{tabular}
\end{center}

Os modelos \texttt{CatBoost} dominaram o ranking OOF (0.114–0.117 RMSE), enquanto
LGB, XGB e HGB ficaram na faixa 0.124–0.126, contribuindo com diversidade ao
ensemble.
\subsection{Busca de Hiperparâmetros com Optuna}
\label{sec:orgd709ed2}

Os hiperparâmetros de \texttt{cat\_a} e \texttt{lgb\_best} são encontrados por busca
bayesiana com \texttt{Optuna} (\texttt{n\_trials=50}), usando OOF RMSE em validação cruzada
de 5 folds como métrica. O espaço de busca cobre \texttt{iterations},
\texttt{learning\_rate}, \texttt{depth}, \texttt{l2\_leaf\_reg}, \texttt{bagging\_temperature},
\texttt{border\_count} e \texttt{random\_strength} (CatBoost), e os parâmetros análogos do
LGB. Os parâmetros dos demais modelos (\texttt{cat\_b} a \texttt{cat\_e}, \texttt{xgb\_best}, \texttt{hgb})
são fixos e cobrem regiões complementares do espaço de hipóteses, garantindo
diversidade.
\subsection{Validação Cruzada (10-fold, 3 repetições)}
\label{sec:orge46a8cb}

O treinamento dos base learners utiliza \texttt{RepeatedKFold} com 10 splits e
\textbf{3 repetições} (\texttt{N\_REPEATS=3}, totalizando 30 folds), o que reduz a
variância da estimativa OOF em \texttt{√3 ≈ 1,73×}.

Para cada fold:

\begin{enumerate}
\item \texttt{SimpleImputer(median)} + \texttt{RobustScaler} aplicados \textbf{apenas nos dados de treino}.
\item \texttt{TargetEncoder(smoothing=10)} ajustado \textbf{apenas nos dados de treino}.
\item \texttt{PCA(n\_components=10)} sobre o bloco categórico \emph{encoded}.
\item Concatenação: \texttt{[numérico\_escalado | cat\_encoded | PCA\_cat]}.
\item Treinamento com early stopping (300 rounds para \texttt{CatBoost}, 200 para \texttt{LGB/XGB}).
\end{enumerate}

Este procedimento garante \textbf{zero data leakage} entre folds.
\subsection{Nível 2 — Meta-Learners}
\label{sec:org30e4ae5}

Quatro estratégias de blending são treinadas sobre as predições OOF,
enriquecidas com \textbf{features de 2ª ordem} (média, desvio-padrão, máximo, mínimo
e amplitude entre os 8 modelos):

\begin{center}
\begin{tabular}{lrl}
Meta-Learner & OOF RMSE & Notas\\
\hline
\texttt{RidgeCV} & 0.112582 & Treinado sobre features de 2ª ordem\\
\texttt{ElasticNetCV} & 0.112599 & \$\(\alpha\)\$=0.00007, \$l\_1\$=0.90\\
\texttt{LassoCV (+)} & 0.113698 & \texttt{positive=True}; pesos: cat\_c=0.35, cat\_e=0.68\\
Optuna (direto) & 0.114212 & Busca \emph{simplex} sobre OOF base\\
\end{tabular}
\end{center}
\subsection{Meta-Blending Final (Optuna)}
\label{sec:org42197cc}

Um segundo nível de Optuna combina os quatro meta-learners:

\begin{verbatim}
★ Pesos finais:
  ridge        : 0.6167
  elasticnet   : 0.3831
  lasso_pos    : 0.0001
  direct_opt   : 0.0001

★ OOF RMSE FINAL: 0.112577
\end{verbatim}
\subsection{Pseudo-Labelling (2ª Passagem)}
\label{sec:org9f3736d}

Após o blending final, amostras de teste com baixa variância entre as
predições dos 8 modelos (percentil 30 do desvio-padrão) são adicionadas ao
conjunto de treino com suas labels previstas. O \emph{pipeline} completo é
re-treinado sobre esse conjunto aumentado, e as predições finais são extraídas
da 2ª passagem.

\begin{verbatim}
std_test  = test_matrix.std(axis=1)
confident = std_test < np.percentile(std_test, 30)
X_aug = pd.concat([X, X_test[confident]], ignore_index=True)
y_aug = pd.concat([y, pd.Series(final_log[confident])], ignore_index=True)
# → re-treino completo do CV loop sobre X_aug, y_aug
\end{verbatim}
\section{Pré-processamento \texttt{Inside-Fold}}
\label{sec:org752206c}

\begin{verbatim}
Para cada fold k:
  ┌─────────────────────────────────────────────────────────────────┐
  │ X_train_k, X_val_k = split(X, fold=k)                           │
  │                                                                 │
  │ imputer.fit(X_train_k[num])   → X_train_num, X_val_num          │
  │ scaler.fit(X_train_k[num])    → (RobustScaler)                  │
  │                                                                 │
  │ TargetEncoder.fit(X_train_k, y_train_k)                         │
  │   → X_train_te, X_val_te, X_test_te                             │
  │                                                                 │
  │ PCA(10).fit(X_train_te)       → X_train_pca, X_val_pca          │
  │                                                                 │
  │ X_full = hstack[num | te | pca]                                 │
  │                                                                 │
  │ Para cada base model m:                                         │
  │   model.fit(X_train_full, y_train, eval=(X_val_full, y_val))    │
  │   oof[val_idx, m] += model.predict(X_val_full)                  │
  │   test_preds[m]   += model.predict(X_test_full) / n_folds       │
  └─────────────────────────────────────────────────────────────────┘
\end{verbatim}
\section{Resultados}
\label{sec:org7ea2461}

\subsection{RMSE por Base Learner (OOF, escala logarítmica)}
\label{sec:orgf807026}

\begin{center}
\begin{tabular}{lr}
Modelo & OOF RMSE\\
\hline
\texttt{cat\_e} & 0.114478\\
\texttt{cat\_c} & 0.115069\\
\texttt{cat\_a} & 0.115290\\
\texttt{cat\_b} & 0.116325\\
\texttt{cat\_d} & 0.117181\\
\texttt{hgb} & 0.124021\\
\texttt{lgb\_best} & 0.124906\\
\texttt{xgb\_best} & 0.125658\\
\end{tabular}
\end{center}
\subsection{Resultado Final}
\label{sec:org4c007f7}

\begin{center}
\begin{tabular}{ll}
Métrica & Valor\\
\hline
OOF RMSE (log) & \textbf{0.112577}\\
Escala da predição & Preço em USD\\
Range de predições & {[}46 419 , 569 716]\\
Arquivo de submissão & \texttt{n-rosenthal-{}-{}submission-6.csv}\\
\end{tabular}
\end{center}
