lab-5/lab05_files/lab05_files/relatorio.tex
\section{Conclusão}
\label{sec:org3cdf2a8}

O \emph{pipeline} implementado alcançou OOF RMSE de \textbf{0.112577} em escala log,
correspondendo a um erro médio de aproximadamente ±12\% no preço de venda.

Os principais fatores de sucesso foram:

\begin{enumerate}
\item \textbf{Engenharia de features cuidadosa}: 45 features derivadas de conhecimento
do domínio imobiliário, com destaque para as interações \texttt{OverallQual × TotalSF}
e os novos scores compostos (\texttt{ExterScore}, \texttt{FireScore}, \texttt{BsmtScore}).

\item \textbf{Correção de tipos antes da separação de colunas}: converter \texttt{MSSubClass},
\texttt{MoSold} e \texttt{YrSold} para \texttt{string} antes de definir \texttt{cat\_cols\textasciitilde{}/\textasciitilde{}num\_cols}
evita que variáveis nominais sejam tratadas como contínuas.

\item \textbf{Imputação semântica de \texttt{GarageYrBlt}}: usar \texttt{YearBuilt} em vez de \texttt{0}
elimina um viés que confunde os modelos de boosting.

\item \textbf{Target encoding dentro do fold}: eliminou \emph{data leakage} e permitiu
capturar variações de preço por bairro (\texttt{Neighborhood}).

\item \textbf{Diversidade no ensemble}: combinar CatBoost (cinco variantes com
configurações distintas), LGB, XGB e HGB gerou ganho consistente sobre
qualquer modelo individual.

\item \textbf{Meta-blending via Optuna com features de 2ª ordem}: a adição de
estatísticas (média, desvio, range) sobre as predições OOF enriqueceu
o meta-learner; a combinação de Ridge e ElasticNet pesada pelo Optuna
superou qualquer meta-learner isolado.

\item \textbf{Pseudo-labelling com re-treino completo}: a 2ª passagem do CV loop sobre
o conjunto aumentado com amostras de teste de alta confiança contribuiu
para redução adicional do erro.
\end{enumerate}
\end{document}
